Repository: CORS1ER/docs
Catalog: locale/*/LC_MESSAGES/developers/dip3-upgrade.po
Languages: fr, it, ru, zh_cn

source: The upgrade to Dash 0.13.0 involves changes to signature formats as defined in DIP3. This documentation highlights the upgrade steps and progress.
fr: La mise à jour vers Dash 0.13.0 entraîne des changements dans les formats de signature, tels que définis par la DIP3. La présente documentation vous accompagne dans le processus de mise à jour.
it: L'aggiornamento a Dash 0.13.0 comporta modifiche ai formati di firma definiti in DIP3. Questa documentazione evidenzia i passaggi e l'avanzamento dell'aggiornamento.
ru: Обновление Dash до версии 0.13.0 включает изменения в форматах подписи, как это определено в DIP3. В данной документации описываются шаги и процесс обновления.
zh_cn: 升级到 Dash 0.13.0 涉及到DIP3 中定义的签名格式改变。此文档重点介绍了相关升级步骤与过程。

source: dash, cryptocurrency, masternode, miners, pools, exchanges, wallets, maintenance, dip3, upgrade, deterministic, dmt
fr: dash, cryptomonnaie, masternode, mineurs, équipes, plateformes de change, portefeuilles, maintenance, dip3, mise à jour, déterministe, dmt
it: dash, criptovaluta, masternode, minatori, pool, scambi, portafogli, manutenzione, dip3, aggiornamento, deterministico, dmt
ru: dash, криптовалюта, мастернода, майнеры, пулы, биржи, кошельки, обслуживание, dip3, обновление, детерминированный, dmt
zh_cn: 达世，加密货币，超级节点，矿工，矿池，交易所，钱包，维护，DIP3，升级，确定性，DMT

source: Dash 0.13 Upgrade Information
fr: Information sur la mise à jour Dash 0.13
it: Dash 0.13 info aggiornamento
ru: Информация по обновлению Dash до версии 0.13
zh_cn: Dash 0.13 升级信息

source: **Official binaries are available at** https://github.com/dashpay/dash/releases/tag/v0.13.3.0
fr: **Les logiciels officiels sont disponibles à l'adresse** https://github.com/dashpay/dash/releases/tag/v0.13.3.0
it: **Le applicazioni ufficiali in formato binario sono disponibili a** https://github.com/dashpay/dash/releases/tag/v0.13.3.0
ru: **Официальные бинарные файлы доступны на** https://github.com/dashpay/dash/releases/tag/v0.13.3.0
zh_cn: 官方二进制包可从 https://github.com/dashpay/dash/releases/tag/v0.13.3.0 获得

source: Dash Core v0.13.0 is intended to serve as the foundation for Dash Evolution, a broadly scoped update to our network intended to facilitate and enable new payment methods and technologies. Please see the `Dash Core v0.13.0 Product Brief <https://blog.dash.org/product-brief-dash-core-release-v0-13-0-5d7fddffb7ef>`__ for an overview of new features. The upgrade will take place in phases, as shown in the following diagram:
it: Dash Core v0.13.0 è destinato ad essere la base per Dash Evolution, un ampio aggiornamento della nostra rete volto a semplificare ed abilitare nuovi metodi e tecnologie di pagamento. Si prega di consultare il `Dash Core v0.13.0 Product Brief <https://blog.dash.org/product-brief-dash-core-release-v0-13-0-5d7fddffb7ef>`__ per una panoramica sulle nuove funzionalità. L'aggiornamento avverrà per fasi, come mostrato nel diagramma seguente:

source: Installation notes
fr: Notes sur l'installation
it: Note di installazione
ru: Комментарии по установке
zh_cn: 安装记录

source: Dash Core v0.13.0.0 will automatically activate `DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__ and `DIP004 <https://github.com/dashpay/dips/blob/master/dip-0004.md>`__ once 80% of the network has upgraded. Mining pools must mine an upgraded block and pay an upgraded masternode to successfully signal the upgrade in a block, and 80% of blocks in a window must signal in order to lock in the upgrade. Please confirm the status of network uptake before proceeding as the upgrade path differs slightly depending on on your timing.
fr: Dash Core version 0.13.0.0 activera automatiquement la `DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, la `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__ et la `DIP004 <https://github.com/dashpay/dips/blob/master/dip-0004.md>`__ une fois que 80% du réseau aura été mis à jour. Les équipes de minage doivent miner un bloc mis à jour et payer un masternode mis à jour pour pouvoir signaler la mise à jour dans un bloc, et 80% des blocs dans une certaine fenêtre doivent signaler cette mise à jour pour que celle-ci soit verrouillée. Veuillez vous assurer de l'état de la mise à jour du réseau avant de continuer, car le processus de mise à jour diffère légèrement en fonction de votre calendrier.
it: Dash Core v0.13.0.0 attiverà automaticamente `DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>` __, `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__ and `DIP004 <https://github.com/dashpay/dips/blob/master/dip-0004.md>` __ una volta che l'80% della rete avrà aggiornato. I pool di mining devono estrarre un blocco aggiornato e pagare un masternode aggiornato per segnalare con successo l'aggiornamento in un blocco e l'80% dei blocchi in una finestra deve segnalare per bloccare l'aggiornamento. Si prega di confermare lo stato di utilizzo della rete prima di procedere poiché il percorso di aggiornamento differisce leggermente a seconda dei tempi.
ru: Dash Core версии 0.13.0.0 автоматически активирует `DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__ и `DIP004 <https://github.com/dashpay/dips/blob/master/dip-0004.md>`__ после того как 80% пользователей сети обновят своё программное обеспечение. Майнинговые пулы должны майнить обновлённые блоки с выплатой поощрения обновлённым мастернодам, чтобы успешно сигнализировать обновление. Чтобы обновление зафиксировалось, о нём должны просигнализировать 80% блоков в целевом периоде. Проверьте, пожалуйста, состояние обновления сети, прежде чем продолжить процедуру, так как способ обновления немного отличается в зависимости от стадии обновления.
zh_cn: Dash Core v0.13.0.0 将在 网络 80% 升级完成后 自动激活 `DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__ and `DIP004 <https://github.com/dashpay/dips/blob/master/dip-0004.md>`__。矿池必须挖出一个升级块和支付已升级节点方能表示已升级块，一个窗口期内 80%的为升级块才能锁定。请在按照步骤升级的过期中确认当前网络升级状态，因为方式因阶段不同略有差异。

source: Activation status can be tracked in the image below or at `this site <http://178.254.23.111/~pub/Dash/Dash_Info.html>`__.
fr: L'état de l'activation peut être suivi avec l'image ci-dessous ou sur `ce site <http://178.254.23.111/~pub/Dash/Dash_Info.html>`__.
it: Lo stato di attivazione può essere monitorato nell'immagine sottostante o su questo sito <http://178.254.23.111/~pub/Dash/Dash_Info.html>`__.
ru: Статус активации можно отслеживать по изображению ниже или на `этом сайте <http://178.254.23.111/~pub/Dash/Dash_Info.html>`__.
zh_cn: 激活状态可在如下图片或者网站<http://178.254.23.111/~pub/Dash/Dash_Info.html>`__查看。

source: Dash v0.13.0.0 adoption by miners
fr: Adoption de Dash version 0.13.0.0 par les mineurs
it: Dash v0.13.0.0 adozione da parte dei minatori
ru: Распространение Dash версии 0.13.0.0 среди майнеров
zh_cn: Dash v0.13.0.0 由矿工选举

source: Masternode upgrade status can be tracked at `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__
fr: L'état de mise à jour des masternodes peut être suivi sur le site `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__
it: Lo stato dell'aggiornamento di Masternode può essere monitorato su `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__
ru: Статус обновления мастерноды можно посмотреть на `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__
zh_cn: 超级节点升级状态可在 `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__ 进行跟踪

source: If you are updating to Dash Core v0.13.0.0 **prior** to this 80% threshold you should be able to simply shut down the daemon and replace it with the updated binary.
fr: Si vous faites la mise à jour Dash Core 0.13.0.0 **avant** ce seuil de 80%, il devrait vous suffire d'arrêter simplement le daemon et de le remplacer par l'exécutable mis à jour.
it: Se stai aggiornando a Dash Core v0.13.0.0 ** prima ** di questa soglia dell'80%, dovresti essere in grado di chiudere semplicemente il demone e sostituirlo con il binario aggiornato.
ru: Если ваше обновление Dash Core до версии 0.13.0.0 **предшествует** 80% порогу, вы можете просто выключить демон и заменить его обновлённым бинарным файлом.
zh_cn: 如果你想升级 Dash Core v0.13.0.0 在到 80%下限之前，你可以直接关闭 daemon 然后替换升级的二进制文件。

source: If you are updating to Dash Core v0.13.0.0 **after** this 80% threshold is reached please note that you will need to re-index the chainstate using the “-reindex-chainstate” command.
fr: Si vous faites la mise à jour Dash Core 0.13.0.0 **après** que ce seuil de 80% ait été atteint, veuillez noter que vous devrez réindexer l'état de chaîne au moyen de la commande “-reindex-chainstate”.
it: Se stai aggiornando a Dash Core v0.13.0.0 ** dopo ** che questa soglia dell'80% sarà stata raggiunta, tieni presente che dovrai reindicizzare lo stato della catena utilizzando il comando "-reindex-chainstate".
ru: Если же ваше обновление Dash Core до версии 0.13.0.0 осуществляется **после** достижения 80% порога, обратите внимание, что вам будет необходимо переиндексировать цепь, используя команду “-reindex-chainstate”.
zh_cn: 如果你想升级 Dash Core v0.13.0.0 在到 80%下限之后，请注意你将需要使用“-reindex-chainstate” 命令来 re-index 你的 chainstate。

source: Dependencies
fr: Dépendances
it: Dipendenze
ru: Зависимости
zh_cn: 依赖

source: Please note that Dash Core v0.13.0.0 requires a one-time upgrade to all related software and libraries to ensure continued compatibility.
fr: Veuillez noter que Dash Core version 0.13.0.0 demande une mise à jour en une seule fois de tous les logiciels et bibliothèques associés, afin de garantir une compatibilité continue.
it: Tieni presente che Dash Core v0.13.0.0 richiede un aggiornamento una tantum a tutti i software e le librerie correlati per garantire la compatibilità continua.
ru: Обратите внимание, что версия Dash Core 0.13.0.0 для обеспечения целостной совместимости требует однократного обновления всех связанных программ и библиотек .
zh_cn: 请注意 Dash Core v0.13.0.0 需要一次性将相关软件和库同时升级以确保持续兼容。

source: `DIP002: Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__ contains more information on backwards compatibility.
fr: `DIP002: Transactions spéciales <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__ contient des informations supplémentaires sur la rétro-compatibilité.
it: `DIP002: Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>` __ contiene ulteriori informazioni sulla retrocompatibilità.
ru: `DIP002: Специальные транзакции <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__ содержит дополнительную информацию об обратной совместимости.
zh_cn: `DIP002: Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__ 包含更多向下兼容的信息。

source: Please refer to the `Transaction Type Integration Guide <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__ for information on the implementation of Special Transactions and for examples of this new format.
fr: Veuillez vous référer au `Guide d'intégration des types de transaction <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__ pour obtenir plus d'informations sur l'implémentation des transactions spéciales et pour accéder à des exemples de ce nouveau format.
it: Fare riferimento alla `Transaction Type Integration Guide <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>` __ per informazioni sull'attuazione di operazioni speciali e per esempi di questo nuovo formato.

source: Contact the `Support Desk <https://support.dash.org/en/support/home>`__ with any compatibility questions or for help upgrading.
fr: Veuillez contacter le `service d'assistance <https://support.dash.org/en/support/home>`__ si vous avez des questions sur la compatibilité ou si vous avez besoin d'aide pour la mise à jour.
it: Contatta il `Support Desk <https://support.dash.org/en/support/home>`__ con qualsiasi domanda sulla compatibilità o per assistenza nell'aggiornamento.
ru: По любым вопросам о совместимости или для получения помощи с обновлением обращайтесь в `Службу поддержки <https://support.dash.org/en/support/home>`__ .
zh_cn: 联系`Support Desk <https://support.dash.org/en/support/home>`__ 关于兼容问题和升级帮助。

source: Please see the official `Release Notes <https://github.com/dashpay/dash/blob/v0.13.0.0/doc/release-notes.md#rpc-changes>`__ for a complete listing of RPC improvements, in summary:
fr: Veuillez consulter les `notes officielles de publication <https://github.com/dashpay/dash/blob/v0.13.0.0/doc/release-notes.md#rpc-changes>`__ pour obtenir une liste complète des améliorations RPC, en résumé :
it: Si prega di consultare le "Note di rilascio" ufficiali <https://github.com/dashpay/dash/blob/v0.13.0.0/doc/release-notes.md#rpc-changes>" __ per un elenco completo dei miglioramenti RPC, In sintesi:
ru: Для получения полного списка улучшений RPC смотрите официальные `Примечания к выпуску <https://github.com/dashpay/dash/blob/v0.13.0.0/doc/release-notes.md#rpc-changes>`__, в целом улучшения следующие:
zh_cn: 请查阅`Release Notes <https://github.com/dashpay/dash/blob/v0.13.0.0/doc/release-notes.md#rpc-changes>`__ 获取一份完整的 RPC 改进列表，主要内容如下：

source: **Mining:** ``getBlockTemplate`` now returns an array for masternode payments instead of a single object.
fr: **Minage :** ``getBlockTemplate`` renvoie désormais un tableau des paiements de masternode, plutôt qu'un objet unique.
it: ** Mining: ** `` getBlockTemplate '' invece che singolarmente, ora restituisce una matrice per i pagamenti ai masternode.
ru: **Майнинг:** команда ``getBlockTemplate`` теперь возвращает массив платежей мастерноды вместо одиночного объекта.
zh_cn: **挖矿:** ``getBlockTemplate`` 现在返回一系列主节点支付而不是单个对象。

source: **InstantSend**: instantlock status is now included in ``getrawmempool``, ``getmempoolancestors``, ``getmempooldescendants``, ``getmempoolentry``, ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock``.
fr: **InstantSend** : l'état de verrouillage instantané est désormais inclus dans ``getrawmempool``, ``getmempoolancestors``, ``getmempooldescendants``, ``getmempoolentry``, ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock``.
it: **InstantSend**: lo status di instantlock è ora incluso in ``getrawmempool``, ``getmempoolancestors``, ``getmempooldescendants``, ``getmempoolentry``, ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock``.
ru: **InstantSend**: статус instantlock теперь добавлен в команды ``getrawmempool``, ``getmempoolancestors``, ``getmempooldescendants``, ``getmempoolentry``, ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock``.
zh_cn: **即时支付**：instantlock 状态现在包含在 ``getrawmempool``, ``getmempoolancestors``, ``getmempooldescendants``, ``getmempoolentry``, ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock`` 当中。

source: Libraries and APIs
fr: Bibliothèques et API
it: Librerie e API
ru: Библиотеки и API
zh_cn: 库与 APIs

source: The following lists the current upgrade status for libraries:
fr: Ci-dessous, l'état actuel de mise à jour des bibliothèques :
it: Di seguito è elencato lo stato di aggiornamento corrente per le librerie:
ru: Ниже приведён список текущего состояния обновления библиотек:
zh_cn: 以下列出了当前相关库的升级状态：

source: Name
fr: Nom
it: Nome
ru: Наименование
zh_cn: 名称

source: Platform
fr: Plateforme
it: Piattaforma
ru: Платформа
zh_cn: 平台

source: Upgraded?
fr: Mis à jour ?
it: Aggiornato?
ru: Обновились?
zh_cn: 已升级？

source: `Bitcoin-PHP <https://github.com/Bit-Wasp/bitcoin-php>`__
ru: `Биткойн-PHP <https://github.com/Bit-Wasp/bitcoin-php>`__

source: Android
zh_cn: 安卓
