Repository: CORS1ER/docs
Catalog: locale/*/LC_MESSAGES/developers/dip8-upgrade.po
Languages: de, fr, it, zh_cn

source: The upgrade to Dash 0.14.0 involves the introduction of Long-Living Masternode Quourums as defined in DIP8. This documentation highlights the upgrade steps and progress.
de: Das Dash 0.14.0 upgrade beinhaltet langlebige Masternode-Quoren wie sie gemäß DIP8 definiert wurden. Dieses Dokument beschreibt die Schritte für das Upgrade.
fr: La mise à jour vers Dash 0.14.0 entraîne l'apparition des quorums de masternode de longue durée, tels que définis par la DIP8. La présente documentation vous accompagne dans le processus de mise à jour.
it: L'aggiornamento a Dash 0.14.0 prevede l'introduzione di Long-Living Masternode Quourum come definito in DIP8. Questa documentazione evidenzia i passaggi e l'avanzamento dell'aggiornamento.
zh_cn: Dash 0.14.0的升级引入了 DIP8 中定义的长效主节点仲裁团。本文档强调了升级步骤与过程。

source: dash, cryptocurrency, masternode, miners, pools, exchanges, wallets, maintenance, dip8, upgrade
de: dash, kryptowährung, masternode, miners, pools, börse, wallets, wartung, dip8, upgrade
fr: dash, cryptomonnaie, masternode, mineurs, équipes, plateformes de change, portefeuilles, maintenance, dip8, mise à jour
it: dash, criptovaluta, masternode, minatori, pool, exchange, portafogli, manutenzione, dip8, aggiornamento
zh_cn: dash, 加密货币, 主节点, 矿工, 矿池, 交易所, 钱包, 维护, dip8, 升级

source: Dash 0.14 Upgrade Information
de: Informationen zum Dash 0.14 Upgrade
fr: Information sur la mise à jour Dash 0.14
it: Dash 0.14 Info di aggiornamento
zh_cn: Dash 0.14 升级信息

source: **Official binaries are available at** https://github.com/dashpay/dash/releases/tag/v0.14.0.5
fr: **Les logiciels officiels sont disponibles à l'adresse** https://github.com/dashpay/dash/releases/tag/v0.14.0.5
it: **Le binarie ufficiali sono disponibili su** https://github.com/dashpay/dash/releases/tag/v0.14.0.5

source: Dash Core v0.14.0 is intended to serve as the foundation for Dash Evolution, a broadly scoped update to our network intended to facilitate and enable new payment methods and technologies. Please see the `Dash Core v0.14.0 Product Brief <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__ for an overview of new features. The upgrade will take place in phases, as shown in the following diagram:
de: Dash Core v0.14.0 soll als Grundlage für Dash Evolution dienen und stellt ein breitgefächertes Update für unser Netzwerk dar, um neue Zahlungsmethoden und Technologien bereitzustellen. Bitte lies den `Dash Core v0.14.0 Product Brief <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__ um eine Feature-Übersicht zu erhalten. Das Upgrade findet phasenweise statt, wie in folgendem Diagramm ersichtlich
fr: Dash Core version 0.14.0 est conçu pour servir de socle à Dash Evolution, qui est une mise à jour progressive de notre réseau visant à faciliter et à rendre possibles de nouvelles méthodes et technologies de paiement. Veuillez consulter `la fiche produit Dash Core v0.14.0 <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__ pour un aperçu global des nouvelles fonctionnalités. La mise à jour aura lieu en plusieurs phrases, comme indiqué dans le diagramme suivant :
it: Dash Core v0.14.0 è destinato a fungere da base per Dash Evolution, un aggiornamento ad ampio raggio della nostra rete inteso a facilitare e abilitare nuovi metodi e tecnologie di pagamento. Consultare la descrizione del prodotto `Dash Core v0.14.0 <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__ per una panoramica delle nuove funzionalità. L'aggiornamento avverrà in fasi, come mostrato nel diagramma seguente:
zh_cn: Dash Core v0.14.0 旨在为Dash Evolution提供基石，一个为促进激活新支付方式和技术的全方位网络升级。了解新功能请参考`Dash Core v0.14.0 Product Brief <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__。该升级将分阶段进行，按如下示意图：

source: Installation notes
de: Anmerkungen zur Installation
fr: Notes sur l'installation
it: Note di installazione
zh_cn: 安装记录

source: Dash Core v0.14.0.0 will automatically activate `DIP0008 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ once 80% of the network has upgraded. Mining pools must mine an upgraded block to successfully signal the upgrade in a block, and 80% of blocks in a window must signal in order to lock in the upgrade.
de: Dash Core v0.14.0.0 wird `DIP0008 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ automatisch aktivieren, sobald 80% des Netzwerks das Update installiert haben. Mining Pools müssen einen upgedateten Block minen, um das Update zu signalisieren. 80% der Blöcke in einem Fenster müssen das Update signalisieren, damit es festgeschrieben wird.
fr: Dash Core version 0.14.0.0 activera automatiquement la `DIP008 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ une fois que 80% du réseau aura été mis à jour. Les équipes de minage doivent miner un bloc mis à jour et payer un masternode mis à jour pour pouvoir signaler la mise à jour dans un bloc, et 80% des blocs dans une certaine fenêtre doivent signaler cette mise à jour pour que celle-ci soit verrouillée.
it: Dash Core v0.14.0.0 attiverà automaticamente `DIP0008 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ una volta che l'80% della rete sarà stato aggiornato. I pool di mining devono estrarre un blocco aggiornato per segnalare correttamente l'aggiornamento in un blocco, e l'80% dei blocchi in una finestra deve segnalare per fissare l'aggiornamento.
zh_cn: Dash Core v0.14.0.0 将在 80%的网络完成升级后自动激活`DIP0008 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__。矿池必须在升级区块里面发出升级信号，在一个窗口期内 80%的区块发出升级信号方能锁定升级。

source: Activation status can be tracked in the image below or at `this site <http://178.254.23.111/~pub/Dash/Dash_Info.html>`__.
de: Der Status der Aktivierung kann in dem Bild unten oder über `diese Seite <http://178.254.23.111/~pub/Dash/Dash_Info.html>`__ abgerufen werden.
fr: L'état de l'activation peut être suivi avec l'image ci-dessous ou sur `ce site <http://178.254.23.111/~pub/Dash/Dash_Info.html>`__.
it: Lo stato di attivazione può essere monitorato nell'immagine sottostante o su questo sito <http://178.254.23.111/~pub/Dash/Dash_Info.html>`__.
zh_cn: 激活状态可在如下图片或者网站<http://178.254.23.111/~pub/Dash/Dash_Info.html>`__查看。

source: Dash v0.14.0.0 adoption by miners
de: Dash v0.14.0.0 Adaption durch Miner
fr: Adoption de Dash version 0.14.0.0 par les mineurs
it: Dash v0.14.0.0 adozione da parte dei minatori
zh_cn: Dash v0.14.0.0 矿工应用

source: Masternode upgrade status can be tracked at `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__
de: Masternode kann über `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__ eingesehen werden
fr: L'état de mise à jour des masternodes peut être suivi sur le site `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__
it: Lo stato dell'aggiornamento di Masternode può essere monitorato su `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__
zh_cn: 超级节点升级状态可在 `Dash Ninja <https://www.dashninja.pl/masternodes.html>`__ 进行跟踪

source: If you are updating to Dash Core v0.14.0.0 from version 0.13.x you should be able to simply shut down the daemon and replace it with the updated binary.
de: Wenn du Dash Core von 0.13.x auf v0.14.0.0 updatest, sollte es genügen, wenn du den Daemon herunterfährst und mit den upgedateten Binaries ersetzt.
fr: Si vous faites la mise à jour Dash Core 0.14.0.0 depuis la version 0.13.x, il devrait vous suffire d'arrêter simplement le daemon et de le remplacer par l'exécutable mis à jour.
it: Se stai aggiornando a Dash Core v0.14.0.0 dalla versione 0.13.x dovresti essere in grado di semplicemente chiudere il demone e sostituirlo con il binario aggiornato.
zh_cn: 如果你是从 0.13.x 升级到Dash Core v0.14.0.0，你可以简单地关闭进程然后替换升级后的程序。

source: If you are updating to Dash Core v0.14.0.0 from version < 0.13 please note that you will also need to re-index the chainstate using the “-reindex-chainstate” command.
de: Wenn du Dash Core von < 0.13.x auf v0.14.0.0 updatest, so musst du den Chainstate re-indexen, indem du den Befehl “-reindex-chainstate” verwendest.
fr: Si vous faites la mise à jour Dash Core 0.14.0.0 depuis une version antérieure à la 0.13, veuillez noter que vous devrez réindexer l'état de chaîne au moyen de la commande “-reindex-chainstate”.
it: Se stai aggiornando a Dash Core v0.14.0.0 dalla versione <0.13, tieni presente che dovrai anche reindicizzare il chainstate utilizzando il comando "-reindex-chainstate".
zh_cn: 如果你从低于0.13的版本升级到Dash Core v0.14.0.0，你将需要使用“-reindex-chainstate”命令来重新索引链状态。

source: Dependencies
fr: Dépendances
it: Dipendenze
zh_cn: 依赖

source: `DIP0006: Long-Living Masternode Quorums <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__ contains more information on Long-Living Masternode Quorums.
de: `DIP0006: Long-Living Masternode Quorums <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__ beinhaltet mehr Informationen zu Long-Living Masternode Quorums.
fr: `DIP006 : quorums de masternode à longue durée de vie <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__ contient des informations supplémentaires sur les quorums de masternode à longue durée de vie.
it: `DIP0006: Long-Living Masternode Quorums <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__ contiene ulteriori informazioni sui quorum Masternode di lunga durata.
zh_cn: 关于长效主节点仲裁团的信息参考 `DIP0006: Long-Living Masternode Quorums <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__。

source: `DIP0007: LLMQ Signing Requests / Sessions <https://github.com/dashpay/dips/blob/master/dip-0007.md>`__ contains more information on the signing request / session process that supports the use of LLMQs.
de: `DIP0007: LLMQ Signing Requests / Sessions <https://github.com/dashpay/dips/blob/master/dip-0007.md>`__ beinhaltet mehr Informationen zu dem Signatur-Anfrage / Sitzungsprozess, der die Verwendung von LLMQs unterstützt.
fr: `DIP004 : sessions et requêtes de signature LLMQ <https://github.com/dashpay/dips/blob/master/dip-0007.md>`__ contient des informations supplémentaires sur le processus de session et de requête de signature compatibles avec l'utilisation des quorums de masternode.
it: `DIP0007: LLMQ Sessioni / richieste di firma <https://github.com/dashpay/dips/blob/master/dip-0007.md>`__ contiene ulteriori informazioni sulla richiesta di firma / processo di sessione che supporta l'uso di LLMQ.
zh_cn: 支持使用 LLMQ 的请求 / 会话签名过程的更多信息参考 `DIP0007: LLMQ Signing Requests / Sessions <https://github.com/dashpay/dips/blob/master/dip-0007.md>`__ 。

source: `DIP0008: ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ contains more information on ChainLocks.
de: `DIP0008: ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ beinhaltet mehr Informationen zu ChainLocks.
fr: `DIP008 : ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ contient des informations supplémentaires sur ChainLocks.
it: `DIP0008: ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ contiene ulteriori informazioni su ChainLocks.
zh_cn: `DIP0008: ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ 有更多关于ChainLocks的信息。

source: `DIP0010: LLMQ InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__ contains more information on the updated LLMQ-based InstantSend system.
de: `DIP0010: LLMQ InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__ beinhaltet mehr Informationen zu dem neuen LLMQ-basierten InstantSend-System.
fr: `DIP0010 : InstantSend LLMQ <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__ contient des informations supplémentaires sur la mise à jour d'InstantSend, désormais basée sur les quorums de masternode.
it: `DIP0010: LLMQ InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__ contiene ulteriori informazioni sul sistema InstantSend aggiornato basato su LLMQ.
zh_cn: 基于 LLMQ 的即时发送系统相关的更多信息参考`DIP0010: LLMQ InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__

source: Please refer to the `ChainLocks Integration Guide <https://github.com/dashpay/docs/blob/master/binary/integration/Integration-Resources-Dash-v0.14-ChainLocks.pdf>`__ for information on the implementation of ChainLocks and for examples of this new format.
de: Sieh dir die `ChainLocks Integrationsanleitung <https://github.com/dashpay/docs/blob/master/binary/integration/Integration-Resources-Dash-v0.14-ChainLocks.pdf>`__ an, um die Implementierung von ChainLocks und Beispiele für das neue Format zu betrachten.
fr: Veuillez vous référer au `Guide d'intégration de ChainLocks <https://github.com/dashpay/docs/blob/master/binary/integration/Integration-Resources-Dash-v0.14-ChainLocks.pdf>`__ pour obtenir plus d'informations sur l'implémentation de ChainLocks et pour accéder à des exemples de ce nouveau format.
it: Fare riferimento alla `Guida all'integrazione di ChainLocks <https://github.com/dashpay/docs/blob/master/binary/integration/Integration-Resources-Dash-v0.14-ChainLocks.pdf>`__ per informazioni sull'implementazione di ChainLocks e per esempi di questo nuovo formato.
zh_cn: 关于ChainLocks的实现和这类新格式的例子请参考`ChainLocks Integration Guide <https://github.com/dashpay/docs/blob/master/binary/integration/Integration-Resources-Dash-v0.14-ChainLocks.pdf>`__。

source: Contact the `Support Desk <https://support.dash.org/en/support/home>`__ with any compatibility questions or for help upgrading.
de: Kontaktiere den `Support Desk <https://support.dash.org/en/support/home>`__, falls du Hilfe beim updaten benötigst oder Kompatibilitätsfragen hast.
fr: Veuillez contacter le `service d'assistance <https://support.dash.org/en/support/home>`__ si vous avez des questions sur la compatibilité ou si vous avez besoin d'aide pour la mise à jour.
it: Contatta il `Support Desk <https://support.dash.org/en/support/home>`__ con qualsiasi domanda sulla compatibilità o per assistenza nell'aggiornamento.
zh_cn: 联系`Support Desk <https://support.dash.org/en/support/home>`__ 关于兼容问题和升级帮助。

source: Please see the official `Release Notes <https://github.com/dashpay/dash/blob/v0.14.0.0/doc/release-notes.md#rpc-changes>`__ for a complete listing of RPC improvements, in summary:
de: Sieh dir die offiziellen `Release Notes <https://github.com/dashpay/dash/blob/v0.14.0.0/doc/release-notes.md#rpc-changes>`__ an, um eine komplette Liste der RPC-Verbesserungen zu betrachten, welche hier zusammengefasst sind:
fr: Veuillez consulter les `notes officielles de publication <https://github.com/dashpay/dash/blob/v0.14.0.0/doc/release-notes.md#rpc-changes>`__ pour obtenir une liste complète des améliorations RPC, en résumé :
it: Si prega di consultare le note di rilascio ufficiali <https://github.com/dashpay/dash/blob/v0.14.0.0/doc/release-notes.md#rpc-changes>`__ per un elenco completo dei miglioramenti RPC, in sintesi:
zh_cn: 完整的 RPC 改进列表参考官方 `Release Notes <https://github.com/dashpay/dash/blob/v0.14.0.0/doc/release-notes.md#rpc-changes>`__。

source: **ChainLocks**: chainlock status is now included in ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock``. ``getblock``
de: **ChainLocks**: Chainlock-Status ist nun in ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock``. ``getblock`` eingefügt
fr: **ChainLocks** : l'état de verrouillage de chaîne est désormais inclus dans ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock``, ``getblock``
it: ** ChainLocks **: lo stato del chainlock è ora incluso in `` getrawtransaction``, `` decoderawtransaction``, `` gettransaction``, `` listtransactions``, `` listsinceblock``. `` getblock``
zh_cn: **ChainLocks**: chainlock 状态被包含于 ``getrawtransaction``, ``decoderawtransaction``, ``gettransaction``, ``listtransactions``, ``listsinceblock``. ``getblock`` 命令中。
