Repository: CORS1ER/docs
Catalog: locale/*/LC_MESSAGES/developers/index.po
Languages: fr, it

source: Developers guide and information about sporks and Dash version history
fr: Guide pour les développeurs et informations sur les sporks et sur l'historique des versions Dash
it: Guida per sviluppatori e informazioni sugli sporks e sulla cronologia delle versioni di Dash

source: dash, developers, sporks, version history
fr: dash, développeurs, sporks, historique des versions
it: dash, sviluppatori, sporks, cronologia delle versioni

source: Developers
fr: Développeurs
it: Sviluppatori

source: The `Dash Platform Developer Documentation <https://dashplatform.readme.io/>` contains technical documentation intended to help developers quickly and easily get started with Dash Platform. The `Dash Core Developer Documentation <https://dashcore.readme.io/>` provides detailed documentation on the Dash Core code base, and serves as a reference for experienced developers. These documentation portals can help developers to quickly and efficiently integrate external applications with the Dash ecosystem. Anyone can contribute to the documentation by suggesting edits in the documentation system.
fr: La `documentation Dash Platform pour développeurs <https://dashplatform.readme.io/>` est une documentation technique destinée à aider les développeurs à démarrer rapidement et facilement sur Dash Platform. La `documentation Dash Core pour développeurs <https://dashcore.readme.io/>` fournit une documentation détaillée sur le code de Dash Core, et sert de référence aux développeurs plus expérimentés. Ces portails de documentation peuvent aider les développeurs à intégrer rapidement et efficacement des applications externes à l'écosystème Dash. Chacun peut contribuer à la documentation en suggérant des modifications depuis la documentation elle-même.
it: La `Dash Platform Developer Documentation <https://dashplatform.readme.io/>` contiene la documentazione tecnica intesa ad aiutare gli sviluppatori, in modo facile e rapido, ad iniziare con Dash Platform. La `Dash Core Developer Documentation <https://dashcore.readme.io/>` fornisce una documentazione dettagliata riguardo il codice di base di Dash Core, e serve come riferimento per sviluppatori esperti. Queste bacheche di documentazione possono aiutare gli sviluppatori ad incastonare in modo rapido ed efficiente le applicazioni esterne con l'ecosistema Dash. Chiunque può contribuire all'aggiornamento della documentazione suggerendo modifiche nel sistema di documentazione.

source: The Dash Core Team also maintains the `Dash Roadmap <https://www.dash.org/roadmap/>`_, which sets out delivery milestones for future releases of Dash and includes specific technical details describing how the development team plans to realise each challenge. The Dash Roadmap is complemented by the `Dash Improvement Proposals <https://github.com/dashpay/dips>`_, which contain detailed technical explanations of proposed changes to the Dash protocol itself.
fr: L'équipe Dash Core gère également la `feuille de route Dash <https://www.dash.org/fr/feuille-de-route>`_, qui précise les étapes prévues pour les versions futures de Dash et inclut des détails techniques spécifiques sur la façon dont l'équipe de développement compte concrétiser chaque étape. La feuille de route Dash est accompagnée des `propositions d'amélioration de Dash (Dash Improvement Proposals, DIP) <https://github.com/dashpay/dips>`_, qui comportent des explications techniques détaillées sur les changements proposés au protocole Dash lui-même.
it: Il Dash Core Team mantiene la `Dash Roadmap <https://www.dash.org/roadmap/>`_, che definiscono i tempi di rilascio per le versioni future di Dash e include dettagli tecnici specifici che descrivono come il team di sviluppo intende realizzare ciascuna sfida. La tabella di marcia di Dash è completata dalle `Proposte di miglioramento di Dash <https://github.com/dashpay/dips>`_, che contengono spiegazioni tecniche dettagliate delle modifiche proposte al protocollo Dash stesso.

source: The Dash community organise discussion and development of Dash apps using the following resources:
fr: La communauté Dash débat et organise le développement d'applications Dash au moyen des ressources suivantes :
it: La community di Dash organizza la discussione e lo sviluppo delle app Dash utilizzando i seguenti siti:

source: `Dash Dapp Devs Discord <https://chat.dashdevs.org>`__
fr: `Discord des développeurs d'applications décentralisées Dash <https://chat.dashdevs.org>`__

source: `Dash Bounty Board <https://trello.com/invite/b/FPJzDcok/ea9fc798043d35d61aa8a5df0917cba7/dash-bounty-board>`__
fr: `Programme de récompenses Dash <https://trello.com/invite/b/FPJzDcok/ea9fc798043d35d61aa8a5df0917cba7/dash-bounty-board>`__

source: The remaining sections available below describe practical steps to carry out common development tasks in Dash.
fr: Les sections restantes, disponibles ci-dessous, décrivent en pratique les étapes nécessaires pour accomplir les tâches communes de développement de Dash.
it: Le restanti sezioni disponibili di seguito descrivono i passaggi pratici per eseguire attività di sviluppo comune in Dash.

source: A multi-phased fork, colloquially known as a "spork", is a mechanism unique to Dash used to safely deploy new features to the network through network-level variables to avoid the risk of unintended network forking during upgrades. It can also be used to disable certain features if a security vulnerability is discovered - see :ref:`here <sporks>` for a brief introduction to sporks. This documentation describes the meaning of each spork currently existing on the network, and how to check their respective statuses.
fr: Un fork à plusieurs étapes, connu informellement sous le nom de "spork", est un mécanisme unique à Dash qui est utilisé pour déployer de manière sûre des nouvelles fonctionnalités du réseau, à travers des variables au niveau du réseau, permettant ainsi d'éviter le risque de forks non souhaités du réseau pendant les mises à jour. Il peut aussi être utilisé pour désactiver certaines fonctionnalités si une faille de sécurité est découverte — voir :ref:`ici <sporks>` une brève introduction aux sporks. La présente documentation explique le sens de chaque spork actuellement existant sur le réseau, et comment vérifier leur état respectif.
it: Un fork a più fasi, colloquialmente noto come "spork", è un meccanismo esclusivo di Dash utilizzato per distribuire in modo sicuro nuove funzionalità alla rete tramite variabili a livello di rete per evitare il rischio di fork di rete involontario durante gli aggiornamenti. Può anche essere usato per disabilitare alcune funzionalità se viene scoperta una vulnerabilità di sicurezza - vedi: ref: `qui <sporks>` per una breve introduzione agli spork. Questa documentazione descrive il significato di ogni spork attualmente esistente sulla rete e come controllarne i rispettivi stati.

source: Spork functions
fr: Fonctionnalités de spork
it: Funzioni degli spork

source: Sporks are set using integer values. Many sporks may be set to a particular epoch datetime (number of seconds that have elapsed since January 1, 1970) to specify the time at which they will active. Enabled sporks are set to 0 (seconds until activation). This function is often used to set a spork enable date so far in the future that it is effectively disabled until changed. The following sporks currently exist on the network and serve functions as described below:
fr: Les sporks sont configurés avec des valeurs entières. Beaucoup de sporks peuvent être configurés pour une époque "datetime" donnée (nombre de secondes écoulées depuis le 1er janvier 1970) afin d'indiquer la date et l'heure auxquelles ils deviendront actifs. Les sporks activés sont configurés sur 0 (secondes avant l'activation). Cette fonction est souvent utilisée pour configurer l'activation d'un spork si loin dans le futur qu'il est, en pratique, désactivé jusqu'à nouvel ordre. Les sporks suivants sont actuellement actifs sur le réseau et permettent les fonctions décrites ci-dessous :
it: Gli spork vengono impostati utilizzando valori interi. Molti spork possono essere impostati su una particolare data datetime (numero di secondi trascorsi dal 1 gennaio 1970), per specificare l'ora in cui saranno attivi. Gli spork abilitati sono impostati su 0 (secondi fino all'attivazione). Questa funzione viene spesso utilizzata per impostare una data di abilitazione dello spork così lontano nel futuro da essere effettivamente disabilitato fino a quando non viene modificata. I seguenti spork esistono attualmente sulla rete e servono funzioni come quelle descritte di seguito:

source: Governs the ability of Dash clients to use InstantSend functionality.
fr: Contrôle la capacité des clients Dash à utiliser la fonctionnalité InstantSend.
it: Controlla la capacità dei client Dash per utilizzare la funzionalità InstantSend.

source: If enabled, masternodes will reject blocks containing transactions in conflict with locked but unconfirmed InstantSend transactions.
fr: Lorsqu'il est activé, les masternodes rejettent les blocs contenant des transactions en conflit avec des transactions InstantSend verrouillées mais non confirmées.
it: Se abilitato, i masternode rifiuteranno i blocchi contenenti transazioni in conflitto con transazioni InstantSend bloccate ma non confermate.

source: Enables a new signature format for Dash-specific network messages introduced in Dash 12.3. For more information, see `here <https://github.com/dashpay/dash/pull/1936>`__ and `here <https://github.com/dashpay/dash/pull/1937>`__.
fr: Active un nouveau format de signature pour des messages réseau spécifiques à Dash apparus dans Dash 12.3. Pour en savoir plus, voir `ici <https://github.com/dashpay/dash/pull/1936>`__ et `ici <https://github.com/dashpay/dash/pull/1937>`__.
it: Abilita un nuovo formato di firma per i messaggi di rete specifici di Dash introdotto in Dash 12.3. Per ulteriori informazioni, vedere "qui <https://github.com/dashpay/dash/pull/1936>" __ e "qui <https://github.com/dashpay/dash/pull/1937>" __.

source: If enabled, superblocks are verified and issued to pay proposal winners.
fr: Lorsqu'il est activé, les "superblocs" sont vérifiés puis générés pour payer les propositions budgétaires gagnantes.
it: Se abilitato, i superblocchi vengono verificati ed emessi per pagare i vincitori della proposta.

source: Controls whether `deterministic masternodes <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ are required. When activated, the legacy masternode list logic will no longer run and non-updated masternodes will not be eligible for payment.
fr: Vérifie si les `masternodes déterministes <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ sont requis. Si ce spork est activé, l'ancienne logique de liste des masternodes ne fonctionnera plus, et les masternodes non mis à jour ne seront plus éligibles aux paiements.
it: Controlla se sono necessari `masternode deterministici <https://github.com/dashpay/dips/blob/master/dip-0003.md>` _. Una volta attivato, la logica dell'elenco masternode legacy non verrà più eseguita ed i masternode non aggiornati non saranno idonei per il pagamento.

source: Enables automatic transaction locking for transactions with less than a specified number of inputs, and removes the legacy InstantSend fee. Allows any node to request the transaction lock, not just the sending node.
fr: Active le verrouillage automatique des transactions ayant moins qu'un certain nombre d'entrées, et supprime les frais InstantSend précédemment en vigueur. Permet à tout nœud de demander le verrouillage de transaction, pas seulement au nœud expéditeur.
it: Abilita il blocco automatico delle transazioni per le transazioni con input inferiori ad un determinato numero e rimuove la tariffa InstantSend precedente. Consente a qualsiasi nodo di richiedere il blocco della transazione; non solo il nodo mittente.

source: Enables the `DKG process to create LLMQ quorums <https://github.com/dashpay/dips/blob/master/dip-0006.md>`_. This spork will be turned on once 80% masternodes are upgraded to v0.14, which will enable DKG and DKG-based PoSe.
fr: Active la `procédure DKG pour créer les quorums LLMQ <https://github.com/dashpay/dips/blob/master/dip-0006.md>`_. Ce spork sera activé lorsque 80% des masternodes auront effectué la mise à jour 0.14, ce qui activera la preuve de service (PoSe) DKG et basée sur DKG.
it: Abilita il processo `DKG per creare quorum LLMQ <https://github.com/dashpay/dips/blob/master/dip-0006.md>` _. Questo spork verrà attivato una volta che l'80% dei masternode sarà aggiornato alla v0.14, che abiliterà DKG e PoSe basato su DKG.

source: Enables :ref:`ChainLocks <chainlocks>`, a mechanism of preventing the risk to payments introduced by blockchain reorganization events. ChainLocks are described in `DIP0008 ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__.
fr: Active :ref:`ChainLocks <chainlocks>`, un mécanisme d'élimination des risques de paiement que constituent les réorganisations de blockchain. ChainLocks sont décrits dans la `DIP0008 ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__.
it: Abilita: ref: `ChainLocks <chainlocks>`, un meccanismo di prevenzione del rischio sui pagamenti dovuto ad eventi di riorganizzazione blockchain. I ChainLocks sono descritti in `DIP0008 ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>` __.

source: When enabled, legacy InstantSend is superseded by LLMQ-based InstantSend, as described in `DIP0010 LLMQ-based InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__.
fr: À son activation, les paiements InstantSend traditionnels seront remplacés par InstantSend basé sur LLMQ, tel que décrit dans la `DIP0010 InstantSend basé sur LLMQ <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__.
it: Quando è abilitato, InstantSend legacy viene sostituito da InstantSend basato su LLMQ, come descritto in `DIP0010 InstantSend basato su LLMQ <https://github.com/dashpay/dips/blob/master/dip-0010.md>` __.

source: Viewing spork status
fr: Affichage de l'état de spork
it: Visualizzazione status dello spork

source: The ``spork show`` and ``spork active`` commands issued in the debug window (or from ``dash-cli`` on a masternode) allow you to interact with sporks. You can open the debug window by selecting **Tools > Debug console**.
fr: Les commandes ``spork show`` et ``spork active`` sont saisies dans la fenêtre de débogage (ou en utilisant "dash-cli" sur un masternode) et vous permettent d'interagir avec les sporks. On peut ouvrir la fenêtre de débogage dans Dash Core par le menu **Outils > Console de débogage**.
it: I comandi `` spork show '' e `` spork active '' emessi nella finestra di debug (o da `` dash-cli '' su un masternode) consentono di interagire con gli spork. Puoi aprire la finestra di debug selezionando ** Strumenti> Console di debug **.

source: spork show and spork active output in the Dash Core debug console
fr: affichage de spork et sortie active de spork dans la console de débogage du portefeuille logiciel Dash Core
it: spork show e spork active output nella console di debug di Dash Core

source: Version History
fr: Historique des versions
it: Cronologia delle versioni

source: Full release notes and the version history of Dash are available here:
fr: Les notes de publication complètes et l'historique des versions de Dash sont disponibles ici :
it: Le note di rilascio complete e la cronologia delle versioni di Dash sono disponibili qui:
